src/cf/InformationRegisters/СтатусыОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОтправкиФСС</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтправкиФСС</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтправкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрДСВ_3</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовАДВ_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеПредставленияРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьПерепискаСКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПередачаДСВвПФР</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСведенияОВзносахИСтраховомСтажеСПВ1</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьАнкетаЗастрахованногоЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_6_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</v8:Type>
						<v8:Type>cfg:CatalogRef.КомплектыОтчетностиПерсучета</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаИнформационноеОбслуживаниеСтрахователя</v8:Type>
						<v8:Type>cfg:CatalogRef.ПерепискаСКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовАДВ_3</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_К</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСПВ_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ОписиИсходящихДокументовВНалоговыеОрганы</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПачкаДокументовСПВ_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ОписиВходящихДокументовИзНалоговыхОрганов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_6_1</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовАДВ_1</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОписьПачекСЗВ_6</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСПВ_1</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПачкаДокументовСЗВ_6_4</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСведенияОНачисленномЗаработкеСЗВ63</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_6_3</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовДСВ_1</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОСпецрежимахНалогообложения</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыРеализацииПолномочийНалоговыхОрганов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрСЗВ_6_2</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьЭлектронныеПредставленияРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПередачаСЗВ4вПФР</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьУплатыАДВ_11</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСправкаПоНДФЛВНалоговыйОрган</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ОтправкиФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОтправкиФСС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтчетСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеПредставленияРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправкиНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗашифрованныйПакет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПакета</Name>
					<Comment>Имя файла зашифрованного пакета выгрузки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Протокол обработки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияРезультата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квитанция</Name>
					<Comment>Квитанция успеха</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтправляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Comment>Для представления в упр.формах документооборота с КО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ОтправкиФСРАР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОтправкиФСРАР</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтчетСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеПредставленияРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправкиНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗашифрованныйПакет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПакета</Name>
					<Comment>Имя файла зашифрованного пакета выгрузки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Протокол обработки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияРезультата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтправляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Comment>Для представления в упр.формах документооборота с КО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаСдачиОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыСдачиОтчетностиФСРАР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправкиНаРегиональныйСервер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколРегиональногоСервера</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаверенныйРегиональнымСерверомПакет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаверенныйПакетОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыОтправки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДО.ОбработкаПолученияФормы("РегистрСведений", "СтатусыОтправки", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьСтатусыОтправкиДляФССиФСРАР() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ДокументРегламентированныйОтчет.Ссылка,
				   |	ПоследниеОтправкиФСС.СтатусОтправки КАК СтатусОтправкиФСС,
				   |	ПоследниеОтправкиФСРАР.СтатусОтправки КАК СтатусОтправкиФСРАР
				   |ИЗ
				   |	Документ.РегламентированныйОтчет КАК ДокументРегламентированныйОтчет
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОтправки КАК СтатусыОтправки
				   |		ПО (СтатусыОтправки.Объект = ДокументРегламентированныйОтчет.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				   |			ВложенныеОтправкиФСС.ОтчетСсылка КАК ОтчетСсылка,
				   |			ОтправкиФСС.СтатусОтправки КАК СтатусОтправки
				   |		ИЗ
				   |			(ВЫБРАТЬ
				   |				ОтправкиФСС.ОтчетСсылка КАК ОтчетСсылка,
				   |				МАКСИМУМ(ОтправкиФСС.ДатаОтправки) КАК ДатаОтправки
				   |			ИЗ
				   |				Справочник.ОтправкиФСС КАК ОтправкиФСС
				   |			СГРУППИРОВАТЬ ПО
				   |				ОтправкиФСС.ОтчетСсылка) КАК ВложенныеОтправкиФСС
				   |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтправкиФСС КАК ОтправкиФСС
				   |					ПО ОтправкиФСС.ОтчетСсылка = ВложенныеОтправкиФСС.ОтчетСсылка
				   |					И ОтправкиФСС.ДатаОтправки = ВложенныеОтправкиФСС.ДатаОтправки) КАК ПоследниеОтправкиФСС
				   |		ПО (ПоследниеОтправкиФСС.ОтчетСсылка = ДокументРегламентированныйОтчет.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				   |			ВложенныеОтправкиФСРАР.ОтчетСсылка КАК ОтчетСсылка,
				   |			ОтправкиФСРАР.СтатусОтправки КАК СтатусОтправки
				   |		ИЗ
				   |			(ВЫБРАТЬ
				   |				ОтправкиФСРАР.ОтчетСсылка КАК ОтчетСсылка,
				   |				МАКСИМУМ(ОтправкиФСРАР.ДатаОтправки) КАК ДатаОтправки
				   |			ИЗ
				   |				Справочник.ОтправкиФСРАР КАК ОтправкиФСРАР
				   |			СГРУППИРОВАТЬ ПО
				   |				ОтправкиФСРАР.ОтчетСсылка) КАК ВложенныеОтправкиФСРАР
				   |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтправкиФСРАР КАК ОтправкиФСРАР
				   |					ПО ОтправкиФСРАР.ОтчетСсылка = ВложенныеОтправкиФСРАР.ОтчетСсылка
				   |					И ОтправкиФСРАР.ДатаОтправки = ВложенныеОтправкиФСРАР.ДатаОтправки) КАК ПоследниеОтправкиФСРАР
				   |		ПО (ПоследниеОтправкиФСРАР.ОтчетСсылка = ДокументРегламентированныйОтчет.Ссылка)
				   |ГДЕ
				   |	(СтатусыОтправки.Статус ЕСТЬ NULL
				   |		ИЛИ СтатусыОтправки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправки.ПустаяСсылка))
				   |	И ((НЕ ПоследниеОтправкиФСС.СтатусОтправки ЕСТЬ NULL
				   |		И ПоследниеОтправкиФСС.СтатусОтправки <> ЗНАЧЕНИЕ(Перечисление.СтатусыОтправки.ПустаяСсылка))
				   |		ИЛИ (НЕ ПоследниеОтправкиФСРАР.СтатусОтправки ЕСТЬ NULL
				   |		И ПоследниеОтправкиФСРАР.СтатусОтправки <> ЗНАЧЕНИЕ(Перечисление.СтатусыОтправки.ПустаяСсылка)))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Запись = РегистрыСведений.СтатусыОтправки.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		
		Запись.Объект = Выборка.Ссылка;
		Запись.Прочитать();
		
		Запись.Объект = Выборка.Ссылка;
		Если ЗначениеЗаполнено(Выборка.СтатусОтправкиФСС) Тогда
			Запись.Статус = Выборка.СтатусОтправкиФСС;
		Иначе
			Запись.Статус = Выборка.СтатусОтправкиФСРАР;
		КонецЕсли;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
